app/Models/Konreg/FkbModel.php

    public function getProgram($id_provinsi, $id_unor, $kesepakatan, $sumber = null)
    {
        $builder = $this->db->table('k_kegiatan_baru as fkb');
        $builder->select('fkb.*,m_tematik.tematik,m_kegiatan.nmgiat , m_kro.nm_kro, m_ro.nmro, m_program.kdprogram, m_program.nmprogram,m_kawasan.nama_kawasan, m_program.kdprogram, m_program.nmprogram, m_provinsi.*, m_unor.unor, m_pendanaan.sumber_pendanaan, m_satuan.nama_satuan,  ');
        $builder->join('m_provinsi', 'fkb.id_provinsi = m_provinsi.id', 'left');
        $builder->join('m_unor', 'fkb.id_unor = m_unor.id', 'left');
        $builder->join('m_pendanaan', 'fkb.id_pembiayaan = m_pendanaan.id_pendanaan', 'left');
        $builder->join('m_satuan', 'fkb.id_satuan = m_satuan.id_satuan', 'left');
        $builder->join('m_program', 'fkb.id_unor = m_program.id_unor', 'left');
        $builder->join('m_kawasan', 'fkb.id_kawasan = m_kawasan.kode_kawasan', 'left');
        $builder->join('m_kegiatan', 'fkb.kd_kgiat = m_kegiatan.kdgiat', 'left');
        $builder->join('m_kro', 'fkb.kd_kro = m_kro.kdkro', 'left');
        $builder->join('m_ro', 'fkb.kd_ro = m_ro.kdro', 'left');
        $builder->join('m_tematik', 'fkb.id_tematik = m_tematik.id_tematik', 'left');

        if ($id_provinsi) {
            $builder->where('fkb.id_provinsi', $id_provinsi);
        }
        if ($id_unor) {
            $builder->where('fkb.id_unor', $id_unor);
        }
        if ($kesepakatan) {
            $builder->where('fkb.FKS', $kesepakatan);
        }
        if ($sumber) {
            $builder->where('fkb.sumber', $sumber);
        }
        $query = $builder->get();
---
SELECT `fkb`.*, `m_tematik`.`tematik`, `m_kegiatan`.`nmgiat`, `m_kro`.`nmkro`, `m_ro`.`nmro`, `m_program`.`kdprogram`, `m_program`.`nmprogram`, `m_kawasan`.`nama_kawasan`, `m_program`.`kdprogram`, `m_program`.`nmprogram`, `m_provinsi`.*, `m_unor`.`unor`, `m_pendanaan`.`sumber_pendanaan`, `m_satuan`.`nama_satuan`
FROM `k_kegiatan_baru` as `fkb`
LEFT JOIN `m_provinsi` ON `fkb`.`id_provinsi` = `m_provinsi`.`id`
LEFT JOIN `m_unor` ON `fkb`.`id_unor` = `m_unor`.`id`
LEFT JOIN `m_pendanaan` ON `fkb`.`id_pembiayaan` = `m_pendanaan`.`id_pendanaan`
LEFT JOIN `m_satuan` ON `fkb`.`id_satuan` = `m_satuan`.`id_satuan`
LEFT JOIN `m_program` ON `fkb`.`id_unor` = `m_program`.`id_unor`
LEFT JOIN `m_kawasan` ON `fkb`.`id_kawasan` = `m_kawasan`.`kode_kawasan`
LEFT JOIN `m_kegiatan` ON `fkb`.`kd_kgiat` = `m_kegiatan`.`kdgiat`
LEFT JOIN `m_kro` ON `fkb`.`kd_kro` = `m_kro`.`kdkro`
LEFT JOIN `m_ro` ON `fkb`.`kd_ro` = `m_ro`.`kdro`
LEFT JOIN `m_tematik` ON `fkb`.`id_tematik` = `m_tematik`.`id_tematik`
WHERE `fkb`.`id_provinsi` = '11'