app/Models/Konreg/FkwModel.php

SELECT `fkw`.*, `m_tematik`.`tematik`, `m_kegiatan`.`nmgiat`, `m_kro`.`nmkro`, `m_ro`.`nmro`, `m_program`.`kdprogram`, `m_program`.`nmprogram`, `m_program`.`nmprogram`, `m_provinsi`.*, `m_unor`.`unor`, `m_pendanaan`.`sumber_pendanaan`, `m_satuan`.`nama_satuan`
FROM `k_kegiatan_wajib` as `fkw`
LEFT JOIN `m_provinsi` ON `fkw`.`id_provinsi` = `m_provinsi`.`id`
LEFT JOIN `m_unor` ON `fkw`.`id_unor` = `m_unor`.`id`
LEFT JOIN `m_pendanaan` ON `fkw`.`id_pembiayaan` = `m_pendanaan`.`id_pendanaan`
LEFT JOIN `m_satuan` ON `fkw`.`id_satuan` = `m_satuan`.`id_satuan`
LEFT JOIN `m_program` ON `fkw`.`id_unor` = `m_program`.`id_unor`
LEFT JOIN `m_kegiatan` ON `fkw`.`kd_kgiat` = `m_kegiatan`.`kdgiat`
LEFT JOIN `m_kro` ON `fkw`.`kd_kro` = `m_kro`.`kdkro`
LEFT JOIN `m_ro` ON `fkw`.`kd_ro` = `m_ro`.`kdro`
LEFT JOIN `m_tematik` ON `fkw`.`id_tematik` = `m_tematik`.`id_tematik`
WHERE `fkw`.`id_provinsi` = '15'
AND `fkw`.`id_unor` = '06'
---
    public function getProgram($id_provinsi, $id_unor, $kesepakatan, $sumber = null)
    {
        $builder = $this->db->table('k_kegiatan_wajib as fkw');
        $builder->select('fkw.*,m_tematik.tematik,m_kegiatan.nmgiat , m_kro.nm_kro, m_ro.nmro, m_program.kdprogram, m_program.nmprogram, m_program.nmprogram, m_provinsi.*, m_unor.unor, m_pendanaan.sumber_pendanaan, m_satuan.nama_satuan,  ');
        $builder->join('m_provinsi', 'fkw.id_provinsi = m_provinsi.id', 'left');
        $builder->join('m_unor', 'fkw.id_unor = m_unor.id', 'left');
        $builder->join('m_pendanaan', 'fkw.id_pembiayaan = m_pendanaan.id_pendanaan', 'left');
        $builder->join('m_satuan', 'fkw.id_satuan = m_satuan.id_satuan', 'left');
        $builder->join('m_program', 'fkw.id_unor = m_program.id_unor', 'left');

        $builder->join('m_kegiatan', 'fkw.kd_kgiat = m_kegiatan.kdgiat', 'left');
        $builder->join('m_kro', 'fkw.kd_kro = m_kro.kdkro', 'left');
        $builder->join('m_ro', 'fkw.kd_ro = m_ro.kdro', 'left');
        $builder->join('m_tematik', 'fkw.id_tematik = m_tematik.id_tematik', 'left');

        if ($id_provinsi) {
            $builder->where('fkw.id_provinsi', $id_provinsi);
        }
        if ($id_unor) {
            $builder->where('fkw.id_unor', $id_unor);
        }
        if ($kesepakatan) {
            $builder->where('fkw.FKS', $kesepakatan);
        }
        if ($sumber) {
            $builder->where('fkw.sumber', $sumber);
        }
        $query = $builder->get();

SELECT `fkw`.*, `m_tematik`.`tematik`, `m_kegiatan`.`nmgiat`, `m_kabkot`.`kab_kot`, `m_kro`.`nmkro`, `m_ro`.`nmro`, `m_program`.`kdprogram`, `m_program`.`nmprogram`, `m_provinsi`.*, `m_unor`.`unor`, `m_pendanaan`.`sumber_pendanaan`, `m_satuan`.`nama_satuan`
FROM `k_kegiatan_wajib` as `fkw`
LEFT JOIN `m_provinsi` ON `fkw`.`id_provinsi` = `m_provinsi`.`id`
LEFT JOIN `m_unor` ON `fkw`.`id_unor` = `m_unor`.`id`
LEFT JOIN `m_pendanaan` ON `fkw`.`id_pembiayaan` = `m_pendanaan`.`id_pendanaan`
LEFT JOIN `m_satuan` ON `fkw`.`id_satuan` = `m_satuan`.`id_satuan`
LEFT JOIN `m_program` ON `fkw`.`id_unor` = `m_program`.`id_unor`
LEFT JOIN `m_kegiatan` ON `fkw`.`kd_kgiat` = `m_kegiatan`.`kdgiat`
LEFT JOIN `m_kabkot` ON `fkw`.`kode_kabkot` = `m_kabkot`.`id`
LEFT JOIN `m_kro` ON `fkw`.`kd_kro` = `m_kro`.`kdkro`
LEFT JOIN `m_ro` ON `fkw`.`kd_ro` = `m_ro`.`kdro`
LEFT JOIN `m_tematik` ON `fkw`.`id_tematik` = `m_tematik`.`id_tematik`
WHERE `fkw`.`id_fkw` = 'FKW-36-06-0021'
---
    public function getProgramFkwById($id_fkw)
    {
        $builder = $this->db->table('k_kegiatan_wajib as fkw');
        $builder->select('fkw.*,m_tematik.tematik,m_kegiatan.nmgiat ,m_kabkot.kab_kot, m_kro.nm_kro, m_ro.nmro, m_program.kdprogram, m_program.nmprogram, m_provinsi.*, m_unor.unor, m_pendanaan.sumber_pendanaan, m_satuan.nama_satuan ');
        $builder->join('m_provinsi', 'fkw.id_provinsi = m_provinsi.id', 'left');
        $builder->join('m_unor', 'fkw.id_unor = m_unor.id', 'left');
        $builder->join('m_pendanaan', 'fkw.id_pembiayaan = m_pendanaan.id_pendanaan', 'left');
        $builder->join('m_satuan', 'fkw.id_satuan = m_satuan.id_satuan', 'left');
        $builder->join('m_program', 'fkw.id_unor = m_program.id_unor', 'left');
        $builder->join('m_kegiatan', 'fkw.kd_kgiat = m_kegiatan.kdgiat', 'left');
        $builder->join('m_kabkot', 'fkw.kode_kabkot = m_kabkot.id', 'left');
        $builder->join('m_kro', 'fkw.kd_kro = m_kro.kdkro', 'left');
        $builder->join('m_ro', 'fkw.kd_ro = m_ro.kdro', 'left');
        $builder->join('m_tematik', 'fkw.id_tematik = m_tematik.id_tematik', 'left');
        $builder->where('fkw.id_fkw', $id_fkw);
        $query = $builder->get();