app/Models/Master/KabkotProgTahunanModel.php

SELECT `b`.`kab_kot`, `a`.`id_kabkot`
FROM `prog_tahunan_kabkot` as `a`
LEFT JOIN `m_kabkot` as `b` ON `a`.`id_kabkot` = `b`.`id`
WHERE `a`.`id_prog_tahunan` = '2753414'
---
    public function getKabkotProgTahunan($id_prog_tahunan)
    {
        $builder = $this->db->table('prog_tahunan_kabkot as a');
        $builder->join('m_kabkot as b', 'a.id_kabkot = b.id', 'left');
        $builder->select('b.kab_kot, a.id_kabkot');
        $builder->where('a.id_prog_tahunan', $id_prog_tahunan);
        $query = $builder->get();