app/Models/Master/KabkotMemoModel.php

    public function getKabkotMemo($id_memorandum)
    {
        $builder = $this->db->table('prog_memorandum_kabkot as a');
        $builder->join('m_kabkot as b', 'a.id_kabkot = b.id', 'left');
        $builder->select('b.kab_kot, a.id_kabkot');
        $builder->where('a.id_memorandum', $id_memorandum);
        $query = $builder->get();
---
SELECT `b`.`kab_kot`, `a`.`id_kabkot`
FROM `prog_memorandum_kabkot` as `a`
LEFT JOIN `m_kabkot` as `b` ON `a`.`id_kabkot` = `b`.`id`
WHERE `a`.`id_memorandum` = '2733589'