app/Models/Master/MenuModel.php

    public function getMenuTreeByRole($role_id, $parent_id = 0)
    {
        // $priority_id = 74; // Menu dashboard

        $builder = $this->db->table('m_menu m')
            ->select('m.*, p.can_view, p.can_edit, p.can_delete')
            ->join('m_permission p', 'p.id_menu = m.id_menu')
            ->where('p.id_role', $role_id)
            ->where('p.can_view', 1)
            ->where('m.parent_id', $parent_id)
            ->where('m.is_active', 1)
            // ->orderBy("CASE WHEN m.id_menu = $priority_id THEN 0 ELSE 1 END", 'ASC', false)
            // ->orderBy('m.id_menu', 'ASC')
            ->orderBy('m.prioritas', 'ASC')
            ->orderBy('m.id_menu', 'ASC')
            ->get()->getResultArray();
---
SELECT `m`.*, `p`.`can_view`, `p`.`can_edit`, `p`.`can_delete`
FROM `m_menu` `m`
JOIN `m_permission` `p` ON `p`.`id_menu` = `m`.`id_menu`
WHERE `p`.`id_role` = '4'
AND `p`.`can_view` = 1
AND `m`.`parent_id` = 0
AND `m`.`is_active` = 1
ORDER BY `m`.`id_menu` ASC
SELECT `m`.*, `p`.`can_view`, `p`.`can_edit`, `p`.`can_delete`
FROM `m_menu` `m`
JOIN `m_permission` `p` ON `p`.`id_menu` = `m`.`id_menu`
WHERE `p`.`id_role` = '2'
AND `p`.`can_view` = 1
AND `m`.`parent_id` = 0
AND `m`.`is_active` = 1
ORDER BY CASE WHEN m.id_menu = 74 THEN 0 ELSE 1 END ASC, `m`.`id_menu` ASC