app/Models/Master/PejabatModel.php

    public function getPejabat()
    {
        return $this->findAll(); // Fetch all rows from the `pejabat` table
---
SELECT *
FROM `m_pejabat`