app/Models/Master/PendanaanModel.php

SELECT *
FROM `m_pendanaan`
---
    public function getPendanaan()
    {
        return $this->findAll();