app/Models/Master/PermissionModel.php

SELECT `m_permission`.*, `m_menu`.`nama_menu` as `nama_menu`, `m_menu`.`parent_id`
FROM `m_permission`
JOIN `m_menu` ON `m_menu`.`id_menu` = `m_permission`.`id_menu`
WHERE `id_role` = '1'
AND `m_menu`.`is_active` = 1
---
    public function getPermissionsByRole($role_id)
    {
        return $this->select('m_permission.*, m_menu.nama_menu as nama_menu, m_menu.parent_id')
            ->join('m_menu', 'm_menu.id_menu = m_permission.id_menu')
            ->where('id_role', $role_id)
            ->where('m_menu.is_active', 1)
            ->findAll();