app/Models/Master/PraRakorModel.php

    public function getCatatan($id)
    {
        $builder = $this->db->table('prog_tahunan_pra_rakorbangwil as b');
        $builder->select(' b.*');
        $builder->where('b.id_pn', $id);

        $query = $builder->get();
---
SELECT `b`.*
FROM `prog_tahunan_pra_rakorbangwil` as `b`
WHERE `b`.`id_pn` = '2'

    public function getKawasanList($id_provinsi = null, $id_tematik, $id_pn)
    {
        $builder = $this->db->table('prog_tahunan as a');
        $builder->select('DISTINCT(c.nama_kawasan) as kawasan');
        $builder->join('prog_tahunan_kwsn as b', 'a.id_prog_tahunan = b.id_prog_tahunan', 'left');
        $builder->join('m_kawasan as c', 'b.id_kawasan = c.kode_kawasan', 'left');
        $builder->join('m_tematik as d', 'c.id_tematik_kawasan = d.id_tematik', 'left');
        $builder->join('m_sk_ro as e', 'e.id_ro = a.id_ro', 'inner');
        $builder->where('a.id_provinsi', $id_provinsi);
        $builder->where('d.id_tematik', $id_tematik);
        $builder->where('e.id_pn', $id_pn);
        $builder->orderBy('c.kode_kawasan', 'ASC');

        $query = $builder->get();
---
SELECT DISTINCT(c.nama_kawasan) as kawasan
FROM `prog_tahunan` as `a`
LEFT JOIN `prog_tahunan_kwsn` as `b` ON `a`.`id_prog_tahunan` = `b`.`id_prog_tahunan`
LEFT JOIN `m_kawasan` as `c` ON `b`.`id_kawasan` = `c`.`kode_kawasan`
LEFT JOIN `m_tematik` as `d` ON `c`.`id_tematik_kawasan` = `d`.`id_tematik`
INNER JOIN `m_sk_ro` as `e` ON `e`.`id_ro` = `a`.`id_ro`
WHERE `a`.`id_provinsi` = '12'
AND `d`.`id_tematik` = '5'
AND `e`.`id_pn` = '2'
ORDER BY `c`.`kode_kawasan` ASC