app/Models/Master/PropModel.php

SELECT DISTINCT `prp`.`kd_kro`, `m_kro`.`kdkro`, `m_kro`.`nmkro`
FROM `k_pro_p` as `prp`
LEFT JOIN `m_kro` ON `prp`.`kd_kro` = `m_kro`.`kdkro`
WHERE `prp`.`id_prop` = '02.10.07.03'
---
    public function getKro($id_prop)
    {
        //new
        $builder = $this->db->table('k_pro_p as prp');
        $builder->select('prp.kd_kro, m_kro.kdkro, m_kro.nmkro');
        $builder->join('m_kro', 'prp.kd_kro = m_kro.kdkro', 'left');
        $builder->distinct();
        $builder->where('prp.id_prop', $id_prop);
        $query = $builder->get();