app/Models/Master/ProvinsiModel.php

SELECT `m_provinsi`.*
FROM `m_provinsi`
ORDER BY `id` ASC
---
    public function getProvinsi()
    {
        $builder = $this->db->table('m_provinsi');
        $builder->select('m_provinsi.*');
        $builder->orderBy('id', 'ASC');
        $query = $builder->get();