app/Models/Master/RoModel.php

SELECT `msro`.`id_ro`, `msro`.`nm_ro`
FROM `m_sk_ro` as `msro`
WHERE `msro`.`id_kro` = 'FC.7687.BAH'
---
    public function getRo($id_kro)
    {
        $builder = $this->db->table('m_sk_ro as msro');
        $builder->select('msro.id_ro, msro.nm_ro');
        $builder->where('msro.id_kro', $id_kro);
        $query = $builder->get();