app/Models/Master/UnorModel.php

SELECT `m_unor`.*
FROM `m_unor`
WHERE `id` IN ('06','04','05','08')
---
    public function getUnor()
    {
        $builder = $this->db->table('m_unor');
        $builder->select('m_unor.*');
        $builder->whereIn('id', ['06', '04', '05', '08']);
        // $builder->orderBy('id', 'DESC');
        $query = $builder->get();