app/Models/Master/UsulanProvinsiModel.php

    public function getUsulan($id_provinsi = null, $id_unor = null, $id_pn = null, $kesepakatan = null)
    {
        $builder = $this->db->table('k_usulan_provinsi as usulan');
        $builder->select('usulan.*,  m_provinsi.provinsi, m_unor.unor, m_pendanaan.sumber_pendanaan, m_satuan.nama_satuan,  m_kawasan.nama_kawasan, k_pn.nama_pn, k_pp.nama_pp, k_kp.nama_kp, k_pro_p.nama_prop , m_ro.nmro, m_kro.nm_kro');
        $builder->distinct();
        $builder->join('m_provinsi', 'usulan.id_provinsi = m_provinsi.id', 'left');
        $builder->join('m_unor', 'usulan.id_unor = m_unor.id', 'left');
        $builder->join('k_pn', 'usulan.id_pn = k_pn.id_pn', 'left');
        $builder->join('k_pp', 'usulan.id_pp = k_pp.id_pp', 'left');
        $builder->join('k_kp', 'usulan.id_kp = k_kp.id_kp', 'left');
        $builder->join('m_kro', 'usulan.kd_kro = m_kro.kdkro', 'left');
        $builder->join('m_ro', 'usulan.kd_ro = m_ro.kdro', 'left');
        $builder->join('k_pro_p', 'usulan.id_prop = k_pro_p.id_prop', 'left');
        $builder->join('m_satuan', 'usulan.id_satuan = m_satuan.id_satuan', 'left');
        $builder->join('m_pendanaan', 'usulan.id_pendanaan = m_pendanaan.id_pendanaan', 'left');
        $builder->join('m_kawasan', 'usulan.id_kawasan = m_kawasan.kode_kawasan', 'left');
        $builder->where('usulan.is_active', 1);
        // Tambahkan kondisi untuk filter jika parameter tidak null
        if ($id_provinsi) {
            $builder->where('usulan.id_provinsi', $id_provinsi);
        }
        if ($id_unor) {
            $builder->where('usulan.id_unor', $id_unor);
        }
        if ($id_pn) {
            $builder->where('usulan.id_pn', $id_pn);
        }
        if ($kesepakatan) {
            $builder->where('usulan.kesepakatan', $kesepakatan);
        }
        $query = $builder->get();
---
SELECT DISTINCT `usulan`.*, `m_provinsi`.`provinsi`, `m_unor`.`unor`, `m_pendanaan`.`sumber_pendanaan`, `m_satuan`.`nama_satuan`, `m_kawasan`.`nama_kawasan`, `k_pn`.`nama_pn`, `k_pp`.`nama_pp`, `k_kp`.`nama_kp`, `k_pro_p`.`nama_prop`, `m_ro`.`nmro`, `m_kro`.`nmkro`
FROM `k_usulan_provinsi` as `usulan`
LEFT JOIN `m_provinsi` ON `usulan`.`id_provinsi` = `m_provinsi`.`id`
LEFT JOIN `m_unor` ON `usulan`.`id_unor` = `m_unor`.`id`
LEFT JOIN `k_pn` ON `usulan`.`id_pn` = `k_pn`.`id_pn`
LEFT JOIN `k_pp` ON `usulan`.`id_pp` = `k_pp`.`id_pp`
LEFT JOIN `k_kp` ON `usulan`.`id_kp` = `k_kp`.`id_kp`
LEFT JOIN `m_kro` ON `usulan`.`kd_kro` = `m_kro`.`kdkro`
LEFT JOIN `m_ro` ON `usulan`.`kd_ro` = `m_ro`.`kdro`
LEFT JOIN `k_pro_p` ON `usulan`.`id_prop` = `k_pro_p`.`id_prop`
LEFT JOIN `m_satuan` ON `usulan`.`id_satuan` = `m_satuan`.`id_satuan`
LEFT JOIN `m_pendanaan` ON `usulan`.`id_pendanaan` = `m_pendanaan`.`id_pendanaan`
LEFT JOIN `m_kawasan` ON `usulan`.`id_kawasan` = `m_kawasan`.`kode_kawasan`
WHERE `usulan`.`is_active` = 1
AND `usulan`.`id_provinsi` = '15'
AND `usulan`.`id_unor` = '04'