app/Filters/PermissionFilter.php

SELECT *
FROM `m_menu`
WHERE `link` = '/rakorbangwil/program_tahunan'
 LIMIT 1
SELECT *
FROM `m_permission`
WHERE `id_role` = '3'
AND `id_menu` = '29'
 LIMIT 1
---
    public function before(RequestInterface $request, $arguments = null)
    {

        $roleId = user()->id_role;
        if (!$roleId) {
            d($roleId);
            return redirect()->to('/forbidden');
        }

        $link = service('uri');
        $currentlink = $link->getPath();

        $menuModel = new MenuModel();
        $menu = $menuModel->where('link', $currentlink)->first();
        if (!$menu) {
            return redirect()->to('/forbidden');
        }

        $permModel = new PermissionModel();
        $permission = $permModel->where([
            'id_role' => $roleId,
            'id_menu' => $menu['id_menu']
        ])->first();