app/Models/Rpiw/KawasanRpiwModel.php

    public function getKawasanAll()
    {
        $builder = $this->db->table('m_kawasan');
        $builder->select('m_kawasan.nama_kawasan, r_program_kawasan.kode_program');
        $builder->join('r_program_kawasan', 'r_program_kawasan.kode_kawasan = m_kawasan.kode_kawasan', 'left');
        $query = $builder->get();
---
SELECT `m_kawasan`.*
FROM `m_kawasan`
ORDER BY `kode_kawasan` ASC

    public function getKawasan()
    {
        $builder = $this->db->table('m_kawasan');
        $builder->select('m_kawasan.*');
        $builder->orderBy('kode_kawasan', 'ASC');
        $query = $builder->get();
---
SELECT `m_kawasan`.*
FROM `m_kawasan`
ORDER BY `kode_kawasan` ASC

    public function getKawasanByProvinsi($id_provinsi)
    {
        $builder = $this->db->table('m_kawasan');
        $builder->select('m_kawasan.*');
        $builder->orderBy('nama_kawasan', 'ASC');
        if ($id_provinsi != "") {
            $builder->where('id_provinsi', $id_provinsi);
        }
        $query = $builder->get();
---
SELECT `m_kawasan`.*
FROM `m_kawasan`
WHERE `id_provinsi` = '11'
ORDER BY `nama_kawasan` ASC