app/Controllers/BaseController.php

SELECT `id_role`
FROM `users`
WHERE `id` = '85'
 LIMIT 1
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        parent::initController($request, $response, $logger);

        $this->template = new \App\Libraries\Template();
        $userModel = new UserModel();
        $menuModel = new MenuModel();
        $id_user = user()->id;
        $id_role = $userModel->select('id_role')->where('id', $id_user)->first()['id_role'];