app/Controllers/KonregController.php

SELECT *
FROM `m_kegiatan`
WHERE `kdprogram` = 'FC'
SELECT *
FROM `m_kro`
SELECT *
FROM `m_tematik`
SELECT *
FROM `m_kabkot`
WHERE `provinsi` = '36'
---
    public function programFkwEdit($id_fkw)
    {
        $programs = $this->FkwModel->getProgramFkwById($id_fkw);
        $id_program = $programs[0]->kd_prog;
        $id_provinsi = $programs[0]->id_provinsi;
        $kegiatan = $this->kegiatanModel->where('kdprogram', $id_program)->findALl();
        $kro = $this->kroModel->findALl();
        $ro = $this->roModel->findALl();
        $dataSatuan = $this->satuanModel->getSatuan();
        $dataTematik = $this->TematikModel->findAll();


        $data = [
            'p_fkw' => $programs,
            'kegiatan' => $kegiatan,
            'kro' => $kro,
            'ro' => $ro,
            'satuan' => $dataSatuan,
            'tematik' => $dataTematik,
            'kabkot'     => model('App\Models\Master\KabkotModel')->where('provinsi', $id_provinsi)->findAll()