app/Controllers/MenuController.php

SELECT *
FROM `m_menu`
ORDER BY `parent_id` ASC, `id_menu` ASC
---
    public function index()
    {
        $menuModel = new MenuModel();
        $menus = $menuModel->orderBy('parent_id ASC, id_menu ASC')->findAll();