app/Controllers/Rakorbangwil.php

    public function edit($id)
    {

        $t_prog = $this->progTahunanModel->find($id);

        $progTahunan = $this->daftarProgTahunanModel->find($id);
        $selectedKawasan = [];

        if (!empty($progTahunan->kawasan)) {
            $selectedKawasan = array_map('trim', explode(',', $progTahunan->kawasan));
        }
        $selectedKabkot = [];

        if (!empty($progTahunan->kabkot)) {
            $selectedKabkot = array_map('trim', explode(',', $progTahunan->kabkot));
        }
        $stackholder = $this->stakholderModel->orderBy('id_kategori')->orderBy('id_stakeholder')->findAll();
        $namaList = array_column($stackholder, 'short_stakeholder');
        $id_prov = $t_prog->id_provinsi;
        $kabkotProgTahunan = $this->kabkotProgramTahunanModel->getKabkotProgTahunan($id);
        $kabkot = $this->kabkotModel->where('id_prov', $id_prov)->findAll();
        $program = $this->programModel->findAll();
        $kegiatan = $this->kegiatanModel->findAll();;
        $kro = $this->kroModel->findAll();;
        $ro = $this->roModel->findAll();;
        $pendanaan = $this->pendanaanModel->findAll();
        $kawasan = $this->kawasanModel->where('id_provinsi', $id_prov)->findAll();
---
SELECT *
FROM `m_stakeholder`
ORDER BY `id_kategori`, `id_stakeholder`
SELECT *
FROM `m_kabkot`
WHERE `id_prov` = '53'
SELECT *
FROM `m_pendanaan`
SELECT *
FROM `m_kawasan`
WHERE `id_provinsi` = '53'

            }
        }

        if ($progTahunanModel->update($id, $dataToUpdate)) {
---
UPDATE `prog_tahunan` SET `id_program` = 'IA', `id_kegiatan` = 'IA.7715', `id_kro` = 'IA.7715.RBB', `id_ro` = 'IA.7715.RBB.017', `pekerjaan` = 'Sistem Pengelolaan Persampahan Menjadi Sumber Energi Terbarukan Kab. Grobogan', `lokasi` = 'Kab. Grobogan', `justifikasi` = '• Peningkatan Kapasitas TPA Ngembak menjadi green TPA\r\n• Timbulan sampah Kab. Grobogan mencapai 967 ton/hari, dimana sampah masuk TPA pada 2021 sebesar 70 ton/hari. Layanan pengelolaan sampah di Kab. Grobogan baru mencapai 7,24%.\r\n• TPA Ngembak dibangun pada 2016 dan beroperasi pada 2017 dengan umur rencana 10 tahun.\r\n• Kondisi TPA overload TA. 2026 sehingga diharapkan terdapat upaya pengolahan TPA. ', `id_pendanaan` = '99', `anggaran` = '3333333', `id_satuan` = '26', `kebutuhan_dukungan_kl` = '-', `geotag` = NULL, `reviu_puswil` = '-', `volume` = '0', `thn_pelaksanaan` = '2027', `updated_at` = '2025-11-07 06:18:16'
WHERE `prog_tahunan`.`id_prog_tahunan` IN ('2733572')