app/Controllers/RoleController.php

    public function permission($role_id)
    {
        $id_role = user()->id_role;
        $roleModel = new RoleModel();
        $permModel = new PermissionModel();
        $menuModel = new MenuModel();
        $role = $roleModel->where('id', $id_role)->first();
        $menus = $menuModel->orderBy('parent_id ASC, id_menu ASC')->where('m_menu.is_active', 1)->findAll();
---
SELECT *
FROM `m_role`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `m_menu`
WHERE `m_menu`.`is_active` = 1
ORDER BY `parent_id` ASC, `id_menu` ASC