app/Models/Memorandum/DaftarMemoModel.php

    public function getDaftarMemo($id_provinsi, $id_unor, $sumber)
    {
        $builder = $this->db->table('view_prog_memorandum_2529 as a');

        // SELECT clause
        $builder->select("a.*");
        // WHERE clause
        if ($id_provinsi) {
            $builder->where('a.id_provinsi', $id_provinsi);
        }
        if ($id_unor) {
            $builder->where('a.id_unor', $id_unor);
        }
        if ($sumber) {
            $builder->where('a.sumber', $sumber);
        }

        $builder->orderBy('a.id_memorandum', 'ASC');

        // Eksekusi
        $query = $builder->get();
---
SELECT `a`.*
FROM `view_prog_memorandum_2529` as `a`
ORDER BY `a`.`id_memorandum` ASC